d2026/s1/matematiks.org
#+AUTHOR: Serob Tigranyan
#+TITLE: Matematical Analysis
#+LATEX_HEADER: \usepackage{mathptmx}  % Times font
#+LATEX_HEADER: \usepackage{helvet}   % Helvetica font
#+LATEX_HEADER: \renewcommand{\familydefault}{\sfdefault} % Sans-serif as default
#+LATEX_HEADER: \usepackage{titlesec}
#+LATEX_HEADER: \usepackage{lmodern}
#+LATEX_HEADER: \usepackage{tikz}
#+LATEX_HEADER: \usepackage{pgfplots}
#+LATEX_HEADER: \pgfplotsset{compat=1.18}

\newpage

* Calculate Area under Curve
Find the are under the cruve bounded by $y=8+2x-x^2$ & $2x-y+4=0$.
** Finding Points of Intersection
To find the area between the curves, we first need to determine where they intersect. We set the two equations equal to each other:
\[
8+2x-x^2=2x+4
\]
Simplifying:
\[
8+2x-x^2=2x+4
\]
\[
8-x^2=4
\]
\[
-x^2=-4
\]
\[
x^2=4 
\]

Therefore:
\[
x=\pm 2
\]

The curves intersect at $x=-2$ and $x=2$.

\newpage

** Graphical Representation
The shaded region represents the area to be calculated between the parabola and the line.

\begin{center}
\begin{tikzpicture}
\begin{axis}[
    axis lines = center,
    xlabel = $x$,
    ylabel = $y$,
    xmin=-3.5, xmax=3.5,
    ymin=-1, ymax=11,
    width=12cm,
    height=10cm,
    grid=major,
    legend pos=north west,
]

% Plot the parabola
\addplot[
    domain=-3.5:3.5,
    samples=100,
    color=blue,
    thick,
]
{8+2*x-x^2};
\addlegendentry{$y=8+2x-x^2$}

% Plot the line
\addplot[
    domain=-3.5:3.5,
    samples=50,
    color=red,
    thick,
]
{2*x+4};
\addlegendentry{$y=2x+4$}

% Fill the area between curves
\addplot[
    fill=green,
    fill opacity=0.1,
    domain=-2:2,
    samples=100,
] {8+2*x-x^2} \closedcycle;

\addplot[
    fill=white,
    fill opacity=1,
    domain=-2:2,
    samples=50,
] {2*x+4} \closedcycle;

% Mark intersection points
\addplot[only marks, mark=*, mark size=3pt, color=black] coordinates {(-2,0) (2,8)};

\end{axis}
\end{tikzpicture}
\end{center}

\newpage
** Computing the Area
The area between two curves is computed by subtracting the area under the lower curve from the area under the upper curve:
\[
S_1 - S_2
\]
\[
S_1 = \int_{-2}^{2}{8+2x-x^2}dx = \left[ 8x+x^2-\frac{x^3}{3} \right]_{-2}^{2} = \frac{80}{3}
\]
\[
S_2 = \int_{-2}^{2}{2x+4}dx = \left[ x^2+4x \right]_{-2}^{2} = 16
\] 
\[
S_1 - S_2 = \boxed{ \frac{32}{3} }
\]

\newpage

* Show that function satisfies the given formula
Given the function:
\[
z = \ln{x^2+xy+y^2}
\]
Show that this function satisfies the formula below:
\[
x\frac{\partial z}{\partial x} + y\frac{\partial z}{\partial y} = 2
\]

To verify this, we'll compute both partial derivatives and plug them into the formula.
** Differentiate function for x
We apply the chain rule to find the partial derivative with respect to $x$:
\[
\frac{\partial }{\partial x} \ln{x^2+xy+y^2} = \frac{\partial (x^2+xy+y^2)}{\partial x} \cdot \frac{1}{x^2+xy+y^2} = \frac{2x+y}{x^2+xy+y^2}
\]
** Differentiate function for y
Similarily:
\[
\frac{\partial }{\partial y} \ln{x^2+xy+y^2} = \frac{x+2y}{x^2+xy+y^2}
\]
** Plugging back to the formula
Now we substitute the partial derivatives into the original formula and simplify:
\[
x\frac{2x+y}{x^2+xy+y^2} + y\frac{x+2y}{x^2+xy+y^2} = \frac{x(2x+y)+y(x+2y)}{x^2+xy+y^2}
\]
\[
= \frac{2x^2+xy+yx+2y^2}{x^2+xy+y^2}=\frac{2x^2+2xy+2y^2}{x^2+xy+y^2}= \frac{2(x^2+xy+y^2)}{x^2+xy+y^2} = \boxed{2}
\]

\newpage

* Find Convergence/Divergence of the given Series
Given the Series:
\[
\sum_{n=1}^{\infty}{\frac{1}{\sqrt{n(n+1)}}}
\]
Find wether or not this series converges or diverges.
** Find a similar series to compare to
We use the limit comparison test. Because as $n$ grows larger, $\frac{1}{\sqrt{n(n+1)}}$ behaves similarly to $\frac{1}{n}$, we choose:
\[
\sum_{n=1}^{\infty}{\frac{1}{n}}
\]

First, we verify that this comparison series diverges using the integral test:
\[
\int_{1}^{\infty}{\frac{1}{x}dx} = \left[ \ln{\left| x\right|} \right]_{1}^{\infty} = \infty
\]

Since the integral diverges, the harmonic series $\sum_{n=1}^{\infty}{\frac{1}{n}}$ also diverges.
** Limit comparison test
We compute the limit of the ratio of the two series:
\[
\lim_{n\to\infty}{\frac{a_n}{b_n}} = L
\]
\[
\lim_{n\to\infty}{ \frac{\frac{1}{\sqrt{n(n+1)}}}{\frac{1}{n}} } = \lim_{n\to\infty}{ \frac{n}{\sqrt{n(n+1)}} } = \lim_{n\to\infty}{ \frac{n}{\sqrt{n^2(1+\frac{1}{n})}} } = \lim_{n\to\infty}{\frac{n}{n\sqrt{1+\frac{1}{n}}}} = \frac{1}{\sqrt{1 + 0}} = 1
\]

Since the limit equals a positive constant, both series share the same convergence behavior. Because $\sum_{n=1}^{\infty}{\frac{1}{n}}$ diverges, we conclude:
\[
\boxed{\sum_{n=1}^{\infty}{\frac{1}{\sqrt{n(n+1)}}} \text{ diverges}}
\]
